app/controllers/pages_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`name` = 'PageNotFound' AND `pages`.`namespace_id` = 8) LIMIT 1
SELECT count(*) AS count_all FROM `pages` WHERE (namespace_id = 1)
---
  def index
	@pages = Page.paginate(:conditions => ["namespace_id = 1"], :page => params[:page], :per_page => 5, :order => 'created_at DESC')

INSERT INTO `pages` (`created_at`, `updated_at`, `name`, `namespace_id`, `current_revision_id`) VALUES('2012-06-11 05:14:18', '2012-06-11 05:14:18', 'Nitin1 test page', 1, NULL)
---
  def create
    @pageNew = Page.new(params[:pageNew])
	  if params[:pageNew][:name].blank?
		flash[:error_page] = 'Name can not be blank.'
		redirect_to :action => "new"
	  elsif params[:pageNew][:content].blank?
		flash[:error_page] = 'Content can not be blank.'
		redirect_to :action => "new"
 	  else
		  if @pageNew.save

UPDATE `pages` SET `updated_at` = '2012-06-11 05:16:07', `current_revision_id` = 38 WHERE `id` = 26
---
  def update
    @page = Page.find_by_name(params[:id])

    if @page.update_attributes(params[:page])

SELECT * FROM `pages` WHERE (`pages`.`id` = 9)
DELETE FROM `pages` WHERE `id` = 9
DELETE FROM `revisions` WHERE (`revisions`.`page_id` = '21')
---
  def destroy
    @page = Page.find(params[:id])
    @page.destroy

	#@revision = Revision.find(:all, :conditions => ["page_id = ?", params[:id]])
	Revision.delete_all(:page_id => params[:id])